app/controllers/api/v1/cafes_controller.rb

  def index
    # url /api/v1/cafes?title=whatever
    if params[:title].present?
      @cafes = Cafe.where('title ILIKE ?', "%#{params[:title]}%")
    else
      @cafes = Cafe.all
    end
    # Putting the most recently created cafes first
    render json: @cafes.order(created_at: :desc)
---
SELECT "cafes".* FROM "cafes"
SELECT "cafes".* FROM "cafes" ORDER BY "cafes"."created_at" DESC